# IFCOpeningData Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
IFCOpeningData Members
IFCOpeningData Class Methods Properties See Also
---
The IFCOpeningData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the IFCOpeningData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetExtrusionData | Gets extrusion data. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetOpeningSolids | Gets opening solids. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsRecess | Trus if it is a recess, false if it is an opening. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OpeningElementId | The opening element id. |

# See Also
IFCOpeningData Class
Autodesk.Revit.DB.IFC Namespace